Repository: 84000/data-translation-memory
Catalog: toh231-v1.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་ལྟ་བས་ན་ཁྱོད་ཀྱིས་རྣམ་གྲངས་འདིས་ཇི་ལྟར་ཐོས་པ་ཙམ་འམ། བསམས་པ་ཙམ་གྱིས་སོ་སོ་རང་གིས་རིག་པའི་ཆོས་ཁོང་དུ་ཆུད་པར་མི་ནུས་པར་རིག་པར་བྱའོ།
en: “Understand therefore, noble son, that just by listening to or reflecting upon the Dharma one will not be able to comprehend the Dharma in one’s personal experience,” said the Blessed One.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་གསོལ་པ། བཅོམ་ལྡན་འདས་ལེགས་པར་གསུངས་སོ། །བདེ་བར་གཤེགས་པ་ཤིན་ཏུ་ལེགས་པར་གསུངས་སོ།
en: “Blessed One,” said the bodhisattva Sarva­nīvaraṇa­viṣkam­bhin, “you have spoken well. Bliss-Gone One, you have spoken extremely well.

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་ཚུལ་འདི་སུ་དག་གི་རྣར་ཐོས་པར་འགྱུར་བའི་རིགས་ཀྱི་བུ་དེ་དག་གིས་ཆོས་འདི་ཁོང་དུ་ཆུད་པ་ཉིད་དུ་རིག་པར་བགྱིའོ།
en: Blessed One, whoever hears this Dharma teaching will understand and comprehend it.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུ་དེ་དག་གིས་ཆོས་འདི་ཐོབ་པར་བགྱི་བ་ལ་འདི་ཉིད་མ་ལོག་པའི་རྒྱུར་འགྱུར་རོ།
en: Why can I say so? Because, Blessed One, as noble children obtain this Dharma, that in itself becomes the cause of their irreversibility.”

source: རིགས་ཀྱི་བུ་དེ་དག་གིས་ཆོས་འདི་ཐོབ་པར་བྱ་བ་ལ་འདི་ཉིད་མ་ལོག་པའི་རྒྱུར་འགྱུར་རོ།
en: Noble son, when noble children obtain this Dharma, that in itself is the cause of their irreversibility.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན། བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་དབྱིངས་ལ་མཁས་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas possessing these ten qualities are experts with respect to the realm of phenomena.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་ཀྱི་སྤྱོད་ཡུལ་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas possessing ten qualities access emptiness.

source: སྟོབས་ཀྱི་སྟོང་པ་ཉིད་ཀྱང་རབ་ཏུ་ཤེས།
en: knowing the emptiness of the powers,

source: མི་འཇིགས་པའི་སྟོང་པ་ཉིད་ཀྱང་རབ་ཏུ་ཤེས།
en: knowing the emptiness of the fearlessnesses,

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་སྟོང་པ་ཉིད་ཀྱང་རབ་ཏུ་ཤེས།
en: knowing the emptiness of the unique buddha qualities,

source: ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོའི་སྟོང་པ་ཉིད་ཀྱང་རབ་ཏུ་ཤེས།
en: knowing the emptiness of the aggregate of discipline,

source: ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོའི་སྟོང་པ་ཉིད་ཀྱང་རབ་ཏུ་ཤེས།
en: knowing the emptiness of the aggregate of absorption,

source: ཤེས་རབ་ཀྱི་ཕུང་པོའི་སྟོང་པ་ཉིད་ཀྱང་རབ་ཏུ་ཤེས།
en: knowing the emptiness of the aggregate of insight,

source: རྣམ་པར་གྲོལ་བའི་ཕུང་པོའི་སྟོང་པ་ཉིད་ཀྱང་རབ་ཏུ་ཤེས།
en: knowing the emptiness of the aggregate of liberation,

source: རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོའི་སྟོང་པ་ཉིད་ཀྱང་རབ་ཏུ་ཤེས།
en: knowing the emptiness of the aggregate of the vision of liberated wisdom,

source: སྟོང་པའི་སྟོང་པ་ཉིད་ཀྱང་རབ་ཏུ་ཤེས།
en: knowing the emptiness of the empty,

source: དོན་དམ་པའི་སྟོང་པ་ཉིད་ཀྱང་རབ་ཏུ་ཤེས་ཏེ།
en: knowing the emptiness of the ultimate.

source: དེའི་རྒྱུ་དེའི་རྐྱེན་དེའི་གཞིས་
en: Due to such causes, conditions, and bases,

source: སྟོང་པ་ཉིད་དུ་དམིགས་པ་དང་། སྟོང་པ་ཉིད་དུ་འཛིན་པ་དང་། སྟོང་པ་ཉིད་དུ་ལྟ་བ་དང་། སྟོང་པ་ཉིད་ལ་གནས་པའང་མི་དམིགས།
en: they do not observe any emptiness, do not grasp any emptiness, do not have any view of emptiness, and they do not become fixated on emptiness.

source: མེད་པར་ཡང་མི་ལྟུང་ངོ་།
en: they also do not fall into nothingness.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་སྤྱོད་ཡུལ་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities access emptiness.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་མཚན་མ་མེད་པ་ལ་གནས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas possessing ten qualities abide within the absence of marks.

source: ཕྱི་རོལ་གྱི་མཚན་མ་དང་བྲལ་བ་རྣམས་ཡིན། ནང་གི་མཚན་མ་དང་བྲལ་བ་རྣམས་ཡིན། སྤྲོས་པ་ཐམས་ཅད་དང་བྲལ་བ་རྣམས་ཡིན། རྣམ་པར་རྟོག་པ་ཐམས་ཅད་དང་བྲལ་བ་རྣམས་ཡིན། དམིགས་པ་ཐམས་ཅད་དང་བྲལ་བ་རྣམས་ཡིན། གཡོ་བ་ཐམས་ཅད་དང་བྲལ་བ་རྣམས་ཡིན། རྒྱུ་བ་ཐམས་ཅད་དང་བྲལ་བ་རྣམས་ཡིན། དམིགས་པར་བྱ་བ་ཐམས་ཅད་དང་བྲལ་བ་རྣམས་ཡིན། རྣམ་པར་ཤེས་པ་མི་དམིགས་པ་རྣམས་ཡིན། རྣམ་པར་ཤེས་པར་བྱ་བའི་དངོས་པོ་མི་དམིགས་པ་རྣམས་ཡིན་ནོ།
en: They are freedom from outer marks, freedom from inner marks, freedom from all constructs, freedom from all thought, freedom from all apprehending, freedom from all fluctuation, freedom from all movement, freedom from anything to be kept in mind, no observation of consciousness, and no observation of anything to be conscious of.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་མཚན་མ་མེད་པ་ལ་གནས་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities abide within the absence of marks.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་
en: “Blessed One,” asked the bodhisattva Sarva­nīvaraṇa­viṣkam­bhin,

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མཚན་མ་མ་མཆིས་པ་ལ་གནས་པའང་དེ་འདྲ་ན།
en: “given that this is the way that bodhisattvas abide within the absence of marks,

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཅི་འདྲ་བར་བལྟ་བར་བགྱི།
en: how might we regard the abiding of the thus-gone ones?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་གནས་འདི་ནི་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: “Noble son, such matters cannot be framed by thought,” replied the Blessed One.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། བསམ་པའི་ཡུལ་དང་བྲལ་བའི་ཕྱིར་ཏེ།
en: “Why is that? Because they are beyond the realm of thought.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཉིད་རྗེས་སུ་བསམས་ན། སེམས་ཅན་ཐམས་ཅད་མྱོས་པར་འགྱུར་གྱི།
en: Noble son, when they contemplate the intrinsic nature of the thus-gone ones all sentient beings go mad.

source: དེ་བཞིན་གཤེགས་པའི་ཆོས་ཉིད་ཀྱི་ཕ་རོལ་ཏམ། ཚུ་རོལ་མཐོང་བར་མི་འགྱུར།
en: They will see neither beyond, nor within the thus-gone ones’ intrinsic nature.

source: མི་དམིགས་ཀྱི། ཐ་མར་ན་དུབ་པའི་སྐལ་བ་ཅན་དུ་འགྱུར་རོ།
en: Failing to find it they end up fatigued.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་ཟབ་ཅིང་གཏིང་དཔག་དཀའ་ལ་
en: Why is that? Because, noble son, the thus-gone ones are profound and hard to fathom.

source: བསམ་གྱིས་མི་ཁྱབ་པ་དཔག་ཏུ་མེད་པ། རྒྱ་ཆེ་བ་ནམ་མཁའ་དང་འདྲ་བ།
en: They are inconceivable and immeasurable, vast like space.

source: རྟོག་གེ་པ་ཐམས་ཅད་ཀྱི་ཡུལ་ལས་འདས་པ། དམིགས་པ་ཅན་ཐམས་ཅད་ཀྱི་ཡུལ་ལས་འདས་པ་སྟེ།
en: They are completely beyond the sphere of all logicians, and beyond the sphere of all those who apprehend things.

source: དེ་ནི་བརྟག་པ་འམ། བསམ་པ་འམ། གཞལ་བ་འམ། ཚད་གཟུང་བར་མི་ནུས་སོ།
en: Thus they cannot be examined, conceived of, estimated, or measured.”

source: བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་གསོལ་པ། གལ་ཏེ་ཞུས་ནས་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ། བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྐབས་ཕྱེ་ན།
en: “If the Blessed One would grant me the opportunity,” said the bodhisattva Sarva­nīvaraṇa­viṣkam­bhin,

source: བདག་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ཕྱོགས་འགའ་ཞིག་ཞུའོ།
en: “I have a question I would like to put to the Blessed One, the thus-gone, worthy, and perfect Buddha, and hear his response.”

source: འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཁྱོད་ལ་དེ་བཞིན་གཤེགས་པས་རྟག་ཏུ་སྐབས་ཕྱེས་ཁྱོད་དྲིས་ཤིག
en: “Noble son,” replied the Blessed One, “to you the Thus-Gone One will always grant such an opportunity. Go ahead and ask.”

source: བདག་བསྟོད་པ་ནི་བཅོམ་ལྡན་འདས་ཀྱིས་སྐྱེས་བུ་དམ་པ་མ་ལགས་པའི་ཆོས་སུ་གསུང་ན།
en: “The Blessed One teaches that praising oneself is not the way of a holy being.

source: དེ་ཇི་ལྟར་ཆོས་ཀྱི་རྗེ་བཅོམ་ལྡན་འདས་ཉིད་བདག་ལ་བསྟོད་པ་མཛད།
en: How is it, then, that the Lord of Dharma, the Blessed One, praises himself?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ། །ཁྱོད་ཀྱིས་དྲི་བ་ཚུལ་བཞིན་དུ་དྲིས་སོ།
en: “Excellent, noble son. Excellent,” replied the Blessed One. “You have asked your question properly.

source: རིགས་ཀྱི་བུ་དེའི་ཕྱིར་ལེགས་པར་ཤིན་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་། ངས་ཁྱོད་ལ་བཤད་དོ། །བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་
en: Noble son, listen very carefully and keep in mind what I say. I shall explain this to you.”

source: བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ། བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: “Excellent, Blessed One,” said the bodhisattva Sarva­nīvaraṇa­viṣkam­bhin, and he listened as instructed.

source: བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་སེམས་ཅན་འདི་དག་ལ་ཅི་ནས་ཀྱང་ཕན་པ་དང་། བདེ་བ་དང་། ཆོས་ཉིད་ཐོབ་པར་བྱ་བའི་ཕྱིར་བདག་བསྟོད་པ་
en: The Blessed One then said, “Noble son, seeking to bring sentient beings benefit and happiness by all means, and to let them attain the intrinsic nature, the Thus-Gone One praises himself.

source: མ་གཏོགས་པར་ང་རྒྱལ་གྱི་ཟིལ་གྱིས་ནོན་པ་དང་། རྙེད་པའི་ཟིལ་གྱིས་ནོན་པ་དང་། བཀུར་སྟིའི་ཟིལ་གྱིས་ནོན་པ་དང་། གྲགས་པ་འདོད་པ་དང་།
en: He does so exclusively for this reason, and never because he is controlled by pride or the wish for wealth, respect, or fame.

source: ཤེས་ཀྱི་ཁེ་འདོད་པའི་ཕྱིར་ཚུལ་འཆོས་པའམ། ཁ་གསག་བྱེད་ཅིང་ཡང་དག་པ་མ་ཡིན་པར་བདག་བསྟོད་པ་མ་ཡིན་ནོ།
en: He does not praise himself with any other irrelevant motive, and his praise is therefore never hypocritical, pretentious, or incorrect.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། སེམས་ཅན་འདི་དག་ནི་དེ་བཞིན་གཤེགས་པ་ལ་དགའ་བ་དང་། དང་བ་དང་། རངས་པ་ཉེ་བར་གཞག་པས་ཆོས་བསྟན་པའི་སྐལ་བ་ཡོད་པར་འགྱུར།
en: Why is that? Because when sentient beings approach the thus-gone ones through joy, faith, and appreciation, they gain the capacity to receive the teaching of the Dharma.

source: དགེ་བའི་ཆོས་རྣམས་ཀྱི་སྣོད་དུ་འགྱུར་ཏེ། དེ་ཡང་དེ་དག་ལ་ཡུན་རིང་པོར་དོན་དང་། ཕན་པ་དང་། བདེ་བར་འགྱུར་རོ།
en: They become vessels for virtuous qualities and will for long enjoy success, benefit, and happiness.”

source: བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཅི་ལགས།
en: “Blessed One, why is this?” asked the bodhisattva Sarva­nīvaraṇa­viṣkam­bhin.

source: སེམས་ཅན་དེ་དག་དེ་བཞིན་གཤེགས་པའི་མཐུ་མ་འཚལ་ཏམ།
en: “Are these sentient beings not already aware of the power of the thus-gone ones?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་མི་ཤེས་སོ།
en: “They are not, noble son,” answered the Blessed One.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་འདིའི་སེམས་ཅན་རྣམས་ནི་རྒྱ་ཆུང་ངུ་ལ་མོས་པ། དམན་ཚེགས་ལ་མོས་པ།
en: “And why is that? Because the sentient beings of this buddha realm are interested in what is insignificant and inferior.

source: ཤེས་རབ་ཆུང་བ། དད་པ་ཆུང་བ། དགེ་བའི་རྩ་བ་ཆུང་ངུས་བརྟན་པ་དག་སྟེ།
en: They have only little in the way of insight, faith, and virtuous roots,

source: དེ་དག་གིས་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་ཆེ་བ་མི་ཤེས་པས་
en: they remain unaware of the magnificence of the thus-gone ones’ qualities.

source: དེ་དག་ལ་དེ་བཞིན་གཤེགས་པ་བདག་ཉིད་བདག་གི་ཡོན་ཏན་གྱི་བསྔགས་པ་བརྗོད་པ་མཛད་དེ། དེའང་ནན་ཏན་གྱིས་སྒྲུབ་བོ།
en: So, for those beings, the thus-gone ones will praise themselves persistently.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་སྨན་པ་མཁས་པ་ཞིག་ཡོད་ལ། སེམས་ཅན་རྣམས་ཀྱང་ནད་ཀྱིས་ཉེན་པར་གྱུར། སའི་ཕྱོགས་དེ་ན་འང་སྨན་པ་གཅིག་པུར་ཟད་དེ་གཉིས་སུ་མེད་ལ།
en: “Noble son, consider this analogy. Imagine that a learned doctor lives where many beings are suffering from disease, and yet at that place there is only this one doctor and no one else.

source: དེའི་ཡོན་ཏན་གྱི་ཆེ་བ་སུས་ཀྱང་མི་ཤེས་པ་དང་། དེ་ནས་སྨན་པ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: The people there do not know of the doctor’s wonderful abilities, and so the doctor thinks to himself,

source: ཀྱེ་མའོ་སེམས་ཅན་འདི་དག་ནི་སྡུག་བསྔལ་བ། ནད་ཀྱིས་ཉེན་པ། སྨན་ལ་མི་མཁས་པ། གནོད་པ་ལ་སྟེན་པ་ཡིན་གྱིས། བདག་གིས་དེ་དག་གསོ་བར་བྱའོ་སྙམ་ནས།
en: ‘Alas, these beings are suffering, stricken by disease, but they do not know much about medicine, and so they continue to suffer. I must cure all these beings!’

source: སྨན་པ་དེས་སེམས་ཅན་དེ་དག་གི་མདུན་དུ་ཀྱེ་སེམས་ཅན་དག་བདག་ནི་སྨན་པ་སྟེ། ནད་ལ་མཁས་པའོ་ནད་ཀྱི་གཞི་ལ་མཁས་པའོ། །སྨན་ལ་མཁས་པའོ་ཞེས་
en: So the doctor then goes before them and says, ‘Hello everyone, I am a doctor. I know well about illnesses and their causes, and I know how to cure them.’

source: བདག་གི་ཡོན་ཏན་གྱི་བསྔགས་པ་བདག་ཉིད་ཀྱིས་བརྗོད་པ་དང་།
en: As he praises his own qualities in this way,

source: སེམས་ཅན་དེ་དག་འདི་ནི་སྨན་པའོ་ཞེས་བྱ་བར་ཤེས་ཤིང་ཡིད་ཆེས་པར་གྱུར་ནས་སྨན་པ་དེ་ལ་རྟེན་ཏོ།
en: the people come to understand what a doctor is, and once they trust him they will follow his cure.

source: དེ་ནས་སྨན་པ་དེས་སེམས་ཅན་དེ་དག་གསོ་ཞིང་ནད་དེ་ཞི་བར་བྱེད་ན།
en: When they do so, the doctor can heal them.

source: རིགས་ཀྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས།
en: Now, noble son, what do you think?

source: སྨན་པ་དེ་བདག་ལ་བསྟོད་པར་འགྱུར་རམ། གསོལ་པ།
en: Will the doctor continue to praise himself once the people have been cured of their illness?”

source: བཅོམ་ལྡན་འདས་མ་ལགས་སོ།
en: “No, Blessed One, he will not.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་ཡང་སྨན་པའི་རྒྱལ་པོ་ཆེན་པོ་བླ་ན་མེད་པ་སྟེ།
en: “Similarly, noble son,” continued the Blessed One, “the thus-gone ones are the unsurpassable, great kings of physicians.

source: ཉོན་མོངས་པའི་ནད་ལ་མཁས་པ། ཉོན་མོངས་པའི་ནད་ཀྱི་གཞི་ལ་མཁས་པ། ཉོན་མོངས་པའི་ནད་གསོ་བ་ལ་མཁས་པ།
en: They know well about the illness of affliction, its causes, and its cure.

source: ཉོན་མོངས་པའི་ནད་ཀྱིས་ནད་པར་གྱུར་པའི་སེམས་ཅན་རྣམས་གཟིགས་ནས། དེ་དག་གི་མདུན་དུ་བདག་གི་ཡོན་ཏན་དང་། བསྔགས་པ་བདག་ཉིད་བརྗོད་དེ།
en: Therefore, as they see them stricken by the disease of affliction, they go before them and declare their own qualities, praising themselves.

source: དེ་ནས་ཉོན་མོངས་པའི་ནད་ཀྱིས་ནད་པར་གྱུར་པའི་སེམས་ཅན་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་བསྔགས་པའི་ཆེ་བ་ཐོས་ནས། ཡིད་ཆེས་པར་གྱུར་པ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་རྟེན་ཏོ།
en: When those beings who are ill in this way hear such extensive praise of the thus-gone ones’ qualities, they gain trust in them and attend to them.

source: དེ་ནས་དེ་དག་ལ་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་རྒྱལ་པོ་ཆེན་པོ་ཆོས་ཀྱི་སྨན་དེ་དག་གིས་ཉོན་མོངས་པའི་ནད་རབ་ཏུ་ཞི་བར་མཛད་དེ།
en: For those beings, the thus-gone ones will then dispense the king of medicines, the medicine of Dharma, and so thoroughly pacify the afflictions of those beings.

source: ཆོས་ཀྱི་སྨན་ཆེན་པོ་དེ་དག་ཀྱང་གང་ཞེ་ན།
en: And what does that potent medicine consist of?

source: འདི་ལྟ་སྟེ། མི་སྡུག་པ་དང་། བྱམས་པ་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་སོགས་པ་སྟེ།
en: It involves repulsiveness, love, dependent origination, and so on.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་དོན་གྱི་དབང་འདི་གཟིགས་ནས། བདག་ལ་བདག་ཉིད་བསྟོད་པ་མཛད་དོ། །
en: Noble son, because they perceive such objectives the thus-gone ones may praise themselves.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སྨོན་ལམ་ཐམས་ཅད་ལ་གནས་པ་དང་བྲལ་བ་ཡིན་ནོ།
en: “Noble son, bodhisattvas possessing ten qualities are not fixated on their aspirations.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྦྱིན་པ་ལ་སྨོན་ཀྱང་སྦྱིན་པ་ལ་མི་གནས་པ་རྣམས་ཡིན། དེ་བཞིན་དུ་ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་དང་། ཁམས་གསུམ་པ་དང་། བྱང་ཆུབ་དང་། ལམ་དང་། མྱ་ངན་ལས་འདས་པ་ལ་སྨོན་ཀྱང་མྱ་ངན་ལས་འདས་པ་ལ་མི་གནས་པ་རྣམས་ཡིན་ཏེ།
en: What are those ten? They are not being fixated on generosity although they aspire to generosity and, similarly, not being fixated on discipline, patience, diligence, concentration, insight, the three realms, awakening, the path, or the transcendence of suffering, although they aspire to each of them.

source: རིགས་ཀྱི་བུ་དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: You may wonder, noble son, why this is so.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་གནས་པ་ཐམས་ཅད་དང་བྲལ་བ་སྟེ། མི་གནས་པར་འཇིག་རྟེན་ཐམས་ཅད་དུ་རྣམ་པར་སྤྱོད་དོ།
en: Bodhisattvas are beyond all forms of fixation, and so they engage with all aspects of the world without fixation.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སྨོན་ལམ་ཐམས་ཅད་ལ་གནས་པ་དང་བྲལ་བ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess these ten qualities are not fixated on any of their aspirations.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པའི་བདག་ཉིད་ཅན་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas possessing ten qualities have a loving nature.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཉི་ཙེ་བ་མེད་པའི་བྱམས་པ་དང་ལྡན་པ་རྣམས་ཡིན། ཐ་དད་པ་མེད་པའི་བྱམས་པ་དང་ལྡན་པ་རྣམས་ཡིན། ཆོས་ཀྱི་བྱམས་པ་དང་ལྡན་པ་རྣམས་ཡིན། ངེས་པར་རྟོགས་པའི་བྱམས་པ་དང་ལྡན་པ་རྣམས་ཡིན། གནོད་པ་མེད་པའི་བྱམས་པ་དང་ལྡན་པ་རྣམས་ཡིན། ཕན་པའི་བྱམས་པ་དང་ལྡན་པ་རྣམས་ཡིན། སེམས་ཅན་ཐམས་ཅད་ལ་སྙོམས་པའི་བྱམས་པ་དང་ལྡན་པ་རྣམས་ཡིན། གནོད་སེམས་མེད་པའི་བྱམས་པ་དང་ལྡན་པ་རྣམས་ཡིན། ཕྱོགས་བཅུ་ཀུན་ཏུ་ཁྱབ་པའི་བྱམས་པ་དང་ལྡན་པ་རྣམས་ཡིན། འཇིག་རྟེན་ལས་འདས་པའི་བྱམས་པ་དང་ལྡན་པ་རྣམས་ཡིན་ཏེ།
en: What are those ten? They have constant love, undifferentiated love, Dharma love, realized love, gentle love, beneficial love, equal love for all beings, love free of ill will, omnipresent love, and transcendent love.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པའི་བདག་ཉིད་ཅན་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess these ten qualities have a loving nature.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེའི་བདག་ཉིད་ཅན་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas possessing ten qualities have a compassionate nature.

source: སེམས་ཅན་སྡུག་བསྔལ་བ་དང་། སྐྱབས་མེད་པ་དང་། མགོན་མེད་པ་དང་། རྟེན་མེད་པ་དང་། དཔུང་གཉེན་མེད་པ་དག་མཐོང་ན། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: When bodhisattvas see sentient beings who suffer, who have no refuge, no protector, no support, and no resort, they engender the mind of awakening.

source: བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས། ཆོས་ཉིད་ཐོབ་པར་བྱ་བའི་ཕྱིར་འབད་ཅིང་རྩོལ། བརྩོན་འགྲུས་རྩོམ་སྟེ། དཀའ་བར་སྤྱོད་པ་བརྒྱ་དག་ཀྱང་བྱེད་དོ། །
en: Having done that, they strive and endeavor to attain the intrinsic nature, mustering diligence and undertaking hundreds of hardships.

source: དེ་དག་ཆོས་ཐོབ་ནས་སེམས་ཅན་རྣམས་ལ་ཕན་པར་བྱེད་དེ།
en: Then, once they have mastered the Dharma, they will benefit sentient beings.

source: འདི་ལྟ་སྟེ། སེམས་ཅན་སེར་སྣ་ཅན་རྣམས་སྦྱིན་པ་ལ་གཞོག་པར་བྱེད། ཚུལ་ཁྲིམས་ངན་པ་ཅན་རྣམས་ཚུལ་ཁྲིམས་ལ། གནོད་སེམས་ཅན་རྣམས་བཟོད་པ་ལ། ལེ་ལོ་ཅན་རྣམས་བརྩོན་འགྲུས་ལ། སེམས་འཁྲུགས་པ་རྣམས་བསམ་གཏན་ལ། སེམས་ཅན་ཤེས་རབ་འཆལ་པ་རྣམས་མཐོང་ནས་ཤེས་རབ་ལ་གཞོག་པར་བྱེད་ཀྱང་།
en: That is to say, they will inspire those who are stingy to be generous, those with flawed discipline to be disciplined, those with ill will to be patient, the lazy to be diligent, the disturbed to be concentrated, and those with misguided intelligence to be insightful.

source: སེམས་ཅན་གྱི་སྡུག་བསྔལ་མི་བཟད་པ། རྩུབ་པ། ཚ་བ་དག་གིས་ཉེན་ཀྱང་
en: All the while, although they are pained by the excruciating, fierce, and burning suffering of beings,

source: བྱང་ཆུབ་ལ་ཕྱིར་ལྡོག་པར་མི་འགྱུར་རོ།
en: their progress to awakening remains irreversible.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེའི་བདག་ཉིད་ཅན་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess these ten qualities have a compassionate nature.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་དགའ་བ་ལ་གནས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas possessing ten qualities are joyful.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བདག་ནི་འཁོར་བའི་བཙོན་ར་རབ་ཏུ་འབར་བ་ནས་བྱུང་བའོ་ཞེས་རབ་ཏུ་དགའ་བ་སྐྱེད་དོ།
en: What are those ten? They are the following greatly joyful thoughts: ‘I have escaped from the flaming prison of cyclic existence.’

source: བདག་གིས་འཁོར་བའི་དཔྱང་ཐག་ཡུན་རིང་པོ་ནས་ཐོགས་པ་ཆད་དོ་ཞེས་དགའ་བ་སྐྱེད་དོ།
en: ‘I have cut the ropes that for so long tied me to cyclic existence.’

source: བདག་ནི་རྣམ་པར་རྟོག་པ་སྣ་ཚོགས་མང་པོའི་ཆུ་སྲིན་གྱིས་དཀྲུགས་པའི་འཁོར་བའི་རྒྱ་མཚོ་ལས་རྒལ་ཏོ་ཞེས་རབ་ཏུ་དགའ་བ་སྐྱེད་དོ།
en: ‘I have crossed the ocean of cyclic existence, plagued as it is by the wild monsters of abundant and manifold thoughts.’

source: བདག་གིས་ཡུན་རིང་པོ་ནས་བསྒྲེང་བའི་ང་རྒྱལ་གྱི་རྒྱལ་མཚན་བསྙལ་ལོ་ཞེས་རབ་ཏུ་དགའ་བ་སྐྱེད་དོ།
en: ‘I have laid down the banner of pride that I held high for so long.’

source: བདག་གིས་ཉོན་མོངས་པའི་རི་རྣམས་ཡེ་ཤེས་ཀྱི་རྡོ་རྗེས་བཅོམ་སྟེ། ཇི་ལྟར་རྡུལ་ཀྱང་མི་སྣང་བ་དེ་ལྟར་བཅོམ་མོ་ཞེས་རབ་ཏུ་དགའ་བ་སྐྱེད་དོ།
en: ‘I have crushed the mountains of affliction with the vajra of wisdom, crushed them so that not even a trace remains.’

source: བདག་ཉིད་ནི་དབུགས་ཕྱིན་པ་ཡིན་གྱིས། ད་ནི་གཞན་ཡང་དབུགས་དབྱུང་བར་བྱའོ་ཞེས་རབ་ཏུ་དགའ་བ་སྐྱེད་དོ།
en: ‘Since I have found relief myself, now is the time to bring relief to others!’

source: བདག་ཉིད་ནི་འཇིག་རྟེན་གནས་པ། ཡུན་རིང་པོ་ནས་གཉིད་ལ་སྲེད་པའི་སྙོམས་པས་ཡོངས་སུ་ཟིན་པ། གཏི་མུག་གིས་བསྒྲིབས་པའི་ནང་ནས་སད་པ་ཡིན་གྱིས། ད་ནི་གཞན་ཡང་རྣམ་པར་སད་པར་བྱའོ་ཞེས་རབ་ཏུ་དགའ་བ་སྐྱེད་དོ།
en: ‘I have awoken from the indolent drowsiness and obscured dullness that for so long seized me in the world. Now is the time to wake up others!’

source: བདག་ཉིད་ནི་ངན་འགྲོ་དང་། ངན་སོང་དང་། ལོག་པར་ལྟུང་བ་ཐམས་ཅད་ལས་རྣམ་པར་གྲོལ་བ་ཡིན་གྱིས། ད་ནི་གཞན་ཡང་ངན་སོང་དང་། ངན་འགྲོ་དང་། ལོག་པར་ལྟུང་བ་ཐམས་ཅད་ལས་རྣམ་པར་གྲོལ་བར་བྱའོ་ཞེས་རབ་ཏུ་དགའ་བ་སྐྱེད་དོ།
en: ‘I have been freed from all the lower realms, the inferior realms, the realms of misfortune. Now it is time to free others from those states.’

source: བདག་འཁོར་བའི་འབྲོག་དགོན་པར་ཡུན་རིང་པོ་ནས་འཁྱམས་ཏེ། གྲོགས་མེད་ཅིང་གཉིས་སུ་མེད་པར་གར་ཡང་འཁྱམ་ཞིང་ལམ་ལ་མི་མཁས་ལ། ལམ་མི་ཤེས་ཤིང་ཡུལ་མི་ཤེས་པས་ལམ་སྟོར་བ་རྙེད་དོ་ཞེས་རབ་ཏུ་དགའ་བ་སྐྱེད་དོ།
en: ‘For so long I have been roaming through the desolate wilderness of cyclic existence, helpless and alone. Unacquainted with the path, I was lost, knowing neither the way nor the land. But now I have found the path!’

source: བདག་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གྲོང་ཁྱེར་དང་ཉེ་བར་གྱུར་ཏོ་ཞེས་རབ་ཏུ་དགའ་བ་སྐྱེད་དོ།
en: ‘I am now close to the city of omniscience!’

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་དགའ་བ་ལ་གནས་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities are joyful.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བཏང་སྙོམས་ལ་གནས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas possessing ten qualities rest in equanimity.

source: མིག་གིས་རྣམ་པར་ཤེས་པར་བྱ་བའི་གཟུགས་རྣམས་ལ་བཏང་སྙོམས་སུ་གནས་པ་རྣམས་ཡིན་ཏེ།
en: They rest in equanimity with respect to the forms that are objects of the eye consciousness.

source: མིག་གིས་རྣམ་པར་ཤེས་པར་བྱ་བའི་གཟུགས་རྣམས་ཀྱིས་སྨས་པར་མི་འགྱུར། གནོད་པར་མི་འགྱུར། རྨ་བྱུང་བར་མི་འགྱུར་བ་རྣམས་དང་།
en: Thus, they are not hurt, harmed, or wounded by those forms.

source: བཏང་སྙོམས་སུ་གནས་པ་རྣམས་ཡིན་ཏེ།
en: they rest in equanimity

source: དེ་བཞིན་དུ་རྣ་བས་རྣམ་པར་ཤེས་པར་བྱ་བའི་སྒྲ་རྣམས་དང་། སྣས་རྣམ་པར་ཤེས་པར་བྱ་བའི་དྲི་རྣམས་དང་། ལྕེས་རྣམ་པར་ཤེས་པར་བྱ་བའི་རོ་རྣམས་དང་། ལུས་ཀྱིས་རྣམ་པར་ཤེས་པར་བྱ་བའི་རེག་བྱ་རྣམས་དང་། ཡིད་ཀྱིས་རྣམ་པར་ཤེས་པར་བྱ་བའི་ཆོས་རྣམས་ལ་
en: with respect to the sounds that are objects of the ear consciousness, the smells that are objects of the nose consciousness, the tastes that are objects of the tongue consciousness, the textures that are objects of the body consciousness, and the mental phenomena that are objects of the mind consciousness.

source: ཆོས་རྣམས་ཀྱིས་སྨས་པར་མི་འགྱུར། གནོད་པར་མི་འགྱུར། རྨ་བྱུང་བར་མི་འགྱུར་རོ།
en: Thus, they are not hurt, harmed, or wounded by any of them.

source: འདུ་བྱེད་ཀྱི་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་གྱི་སྡུག་བསྔལ་དང་། འགྱུར་བའི་སྡུག་བསྔལ་ལ་
en: with respect to the suffering of the conditioned, the suffering of suffering, and the suffering of change.

source: སྨས་པར་མི་འགྱུར། གནོད་པར་མི་འགྱུར། རྨ་བྱུང་བར་མི་འགྱུར་རོ།
en: Thus, they are not hurt, harmed, or wounded by those types of suffering.

source: བྱ་བ་བྱས་པའི་སེམས་ཅན་རྣམས་ལ་བཏང་སྙོམས་སུ་གནས་པ་རྣམས་ཡིན་ཏེ།
en: Finally, they rest in equanimity with respect to those beings whom they have assisted.

source: དེ་དག་ལ་དགའ་བ་དང་། དད་པ་དང་། རངས་པ་སྐྱེད་ཅིང་
en: They feel joy, faith, and delight in them

source: དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ། གང་བདག་གིས་བསྒྲལ་བར་བྱ་བ་དེ་དག་ཉིད་རྒལ་བར་གྱུར་ཏོ་ཞེས་བཏང་སྙོམས་སུ་གནས་པ་རྣམས་ཡིན་ནོ།
en: while resting in equanimity with the thought, ‘Those whom I have freed have indeed crossed over.’

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བཏང་སྙོམས་ལ་གནས་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities rest in equanimity.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་མངོན་པར་ཤེས་པས་རྣམ་པར་རོལ་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas possessing ten qualities revel in superknowledge.
